[
    {
        "text": "INFO 5170 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5170",
        "date": "Fall 2025",
        "topic": "INFO 5170 Title"
    },
    {
        "text": "INFO 5170 covers: Artificial intelligence (AI) is impacting how organizations operate, make decisions, and deliver value across various sectors, including education, law, creative industries, insurance, and information technology. This course introduces the concepts, frameworks, and real-world applications needed to critically analyze how AI is adopted in organizations and the effects it has on work, learning, well-being, and society. Students will explore both the opportunities and risks of AI, including issues of bias, privacy, and organizational responsibility. Weekly hands-on activities and discussions will give students experience auditing or prototyping AI tools using no-code or low-code platforms, and case studies will bring sector-specific challenges to life. A culminating project allows students to investigate AI in a domain of their choice and present their insights in a university-wide showcase.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5170",
        "date": "Fall 2025",
        "topic": "INFO 5170 Description"
    },
    {
        "text": "INFO 5170 is 1170 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5170",
        "date": "Fall 2025",
        "topic": "INFO 5170 Credits"
    },
    {
        "text": "INFO 5170 grading: Basis 3 Credits Opt NoAud (Letter or S/U grades (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5170",
        "date": "Fall 2025",
        "topic": "INFO 5170 Grading"
    },
    {
        "text": "INFO 6350 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6350",
        "date": "Fall 2025",
        "topic": "INFO 6350 Title"
    },
    {
        "text": "INFO 6350 covers: The course will introduce methods for computer-assisted analysis of historical text collections. It will cover corpus curation, representing text as data, building statistical models from text, and interpreting results. Statistical and programming concepts will be introduced as needed. The class will also reflect on how computational methods fit with existing practices in the humanities, and how we can use models as complements to our own interpretations. Following the course, students will be able to assist faculty in computer-assisted scholarship.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6350",
        "date": "Fall 2025",
        "topic": "INFO 6350 Description"
    },
    {
        "text": "INFO 6350 is 3350 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6350",
        "date": "Fall 2025",
        "topic": "INFO 6350 Credits"
    },
    {
        "text": "INFO 6350 grading: Basis 3 Credits Graded (Letter grades only).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6350",
        "date": "Fall 2025",
        "topic": "INFO 6350 Grading"
    },
    {
        "text": "INFO 6350 prerequisites: INFO 6010 or permission of instructor..",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6350",
        "date": "Fall 2025",
        "topic": "INFO 6350 Prerequisites"
    },
    {
        "text": "INFO 5355 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5355",
        "date": "Fall 2025",
        "topic": "INFO 5355 Title"
    },
    {
        "text": "INFO 5355 covers: This course focuses on user experience design (UX) and the life cycle of interface design from the user perspective. We will discuss key aspects of the human-centered design process: understanding, analyzing, and formalizing user needs, exploring possible design solutions to address user needs, creating prototypes to externalize design ideas, and evaluating the usability of these prototypes.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5355",
        "date": "Fall 2025",
        "topic": "INFO 5355 Description"
    },
    {
        "text": "INFO 5355 is 3450 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5355",
        "date": "Fall 2025",
        "topic": "INFO 5355 Credits"
    },
    {
        "text": "INFO 5355 grading: Basis 3 Credits GradeNoAud (Letter grades only (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5355",
        "date": "Fall 2025",
        "topic": "INFO 5355 Grading"
    },
    {
        "text": "INFO 5125 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5125",
        "date": "Fall 2025",
        "topic": "INFO 5125 Title"
    },
    {
        "text": "INFO 5125 covers: This introductory course will emphasize the interpersonal skills necessary by project teams to manage demanding industry projects. Through a semester long simulated IS project, students will develop and apply a range of skills including time management, effective conflict resolution, negotiation, risk management, change control, and appropriate goal setting to adequately manage and execute their projects. Students will work in teams to engage in the 5 phases of the project management life cycle which includes: project initiation, planning, execution, monitoring, and project closure.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5125",
        "date": "Fall 2025",
        "topic": "INFO 5125 Description"
    },
    {
        "text": "INFO 5125 is 4125 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5125",
        "date": "Fall 2025",
        "topic": "INFO 5125 Credits"
    },
    {
        "text": "INFO 5125 grading: Basis 3 Credits GradeNoAud (Letter grades only (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5125",
        "date": "Fall 2025",
        "topic": "INFO 5125 Grading"
    },
    {
        "text": "INFO 5140 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5140",
        "date": "Fall 2025",
        "topic": "INFO 5140 Title"
    },
    {
        "text": "INFO 5140 covers: This course explores selected topics in the law, policy, and politics of cybersecurity. Of specific interest will be a historical understanding of the development of the internet and how that history laid the foundation for the insecurity of products, services, and internet users’ experience. Using a four-factor approach: law, market, social norms, and technology, we will explore the global landscape and its implications for situating cybersecurity in international law and global internet governance. The focus of the course will be on the United States, however, and will include topics such as the federal government’s approach to cybersecurity, the National Cybersecurity Strategy, information security and risk management, types of cyberattacks and case studies, national defense generally and global internet governance.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5140",
        "date": "Fall 2025",
        "topic": "INFO 5140 Description"
    },
    {
        "text": "INFO 5140 is 4140 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5140",
        "date": "Fall 2025",
        "topic": "INFO 5140 Credits"
    },
    {
        "text": "INFO 5140 grading: Basis 3 Credits Stdnt Opt (Letter or S/U grades).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5140",
        "date": "Fall 2025",
        "topic": "INFO 5140 Grading"
    },
    {
        "text": "INFO 5240 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5240",
        "date": "Fall 2025",
        "topic": "INFO 5240 Title"
    },
    {
        "text": "INFO 5240 covers: The social impact of technologies is typically thought about fairly late, if ever, in the design process. Indeed, it can be difficult at design time to predict what effects technologies will have. Nevertheless, design decisions can inadvertently lock in particular values early on. In this course, we will draw on science & technology studies, technology design, and the arts to analyze the values embodied in technology design and to design technologies to promote positive social impact. What social and cultural values do technology designs consciously or unconsciously promote? To what degree can social impact be built into a technology? How can we take social and cultural values into account in design?",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5240",
        "date": "Fall 2025",
        "topic": "INFO 5240 Description"
    },
    {
        "text": "INFO 5240 is 4240 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5240",
        "date": "Fall 2025",
        "topic": "INFO 5240 Credits"
    },
    {
        "text": "INFO 5240 grading: Basis 3 Credits Stdnt Opt (Letter or S/U grades).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5240",
        "date": "Fall 2025",
        "topic": "INFO 5240 Grading"
    },
    {
        "text": "INFO 5321 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5321",
        "date": "Fall 2025",
        "topic": "INFO 5321 Title"
    },
    {
        "text": "INFO 5321 covers: This class provides an introduction to modern rapid prototyping techniques such as laser cutting, 3D printing and microcontroller programming (such as the Arduino system). Using these tools, small multidisciplinary groups conduct the hardware project of their choice exploring topics as varied as: Universal Access, tangible interfaces, toys, personal or medical assistants and new musical instruments.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5321",
        "date": "Fall 2025",
        "topic": "INFO 5321 Description"
    },
    {
        "text": "INFO 5321 is 4320 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5321",
        "date": "Fall 2025",
        "topic": "INFO 5321 Credits"
    },
    {
        "text": "INFO 5321 grading: Basis 4 Credits Opt NoAud (Letter or S/U grades (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5321",
        "date": "Fall 2025",
        "topic": "INFO 5321 Grading"
    },
    {
        "text": "INFO 5321 prerequisites: INFO 2300 or equivalent. Materials fee: $300. Application required. See https://forms.gle/L7jwsBbaduYd2sKC6 to apply. Upon approval, students are responsible for enrolling themselves with a permission number. For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/ Instructor Consent Required (Add).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5321",
        "date": "Fall 2025",
        "topic": "INFO 5321 Prerequisites"
    },
    {
        "text": "INFO 6420 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6420",
        "date": "Fall 2025",
        "topic": "INFO 6420 Title"
    },
    {
        "text": "INFO 6420 covers: \"Re-Designing Robots\" is a studio-based graduate course focused on building and deploying robots in real-world settings such as homes, workplaces, and public spaces. Students will work individually and collaboratively in interdisciplinary teams, incorporating perspectives from engineering, computer science, art, design, and social sciences. The course emphasizes critical examination of the societal roles and ethical implications of robotic technologies, encouraging students to ask not just how robots can function better, but how they can meaningfully and responsibly enhance human activities. Key topics include prototyping interactive robotic systems, video interaction analysis, and hands-on experimentation with physical robot prototypes. Through immersive, hands-on projects, students will develop the expertise to thoughtfully design robots that integrate seamlessly and responsibly into everyday life.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6420",
        "date": "Fall 2025",
        "topic": "INFO 6420 Description"
    },
    {
        "text": "INFO 6420 is 4410 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6420",
        "date": "Fall 2025",
        "topic": "INFO 6420 Credits"
    },
    {
        "text": "INFO 6420 grading: Basis 3 Credits GradeNoAud (Letter grades only (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6420",
        "date": "Fall 2025",
        "topic": "INFO 6420 Grading"
    },
    {
        "text": "INFO 6520 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6520",
        "date": "Fall 2025",
        "topic": "INFO 6520 Title"
    },
    {
        "text": "INFO 6520 covers: This course will introduce User Experience design technique taught in a Studio. Students will work on a series of design studies and a semester long design project exploring advanced User Interaction design techniques. The course is designed to help students start a design portfolio to reflect their work.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6520",
        "date": "Fall 2025",
        "topic": "INFO 6520 Description"
    },
    {
        "text": "INFO 6520 is 4420 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6520",
        "date": "Fall 2025",
        "topic": "INFO 6520 Credits"
    },
    {
        "text": "INFO 6520 grading: Basis 4 Credits Graded (Letter grades only).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/6520",
        "date": "Fall 2025",
        "topic": "INFO 6520 Grading"
    },
    {
        "text": "INFO 5431 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5431",
        "date": "Fall 2025",
        "topic": "INFO 5431 Title"
    },
    {
        "text": "INFO 5431 covers: This course provides practical, experiential training designed to enhance students' teamwork and team-leadership skills through hands-on activities, reflection, and collaborative discussions. Recognizing that technology fundamentally shapes how we collaborate, students will explore how to effectively use technological tools—such as remote collaboration platforms, virtual meeting applications, and novel AI tools—to enhance team interactions and productivity. Each session includes interactive tasks aimed at building critical interpersonal skills, including managing group dynamics, resolving conflicts, improving communication, facilitating decision-making processes, and developing leadership strategies in technologically supported environments. Students will regularly reflect on their personal experiences and collaboratively assess how different technologies influence teamwork and collaboration. Grounded in insights from organizational behavior, social psychology, and human-computer interaction, the course emphasizes the practical application of skills essential for navigating and leading teams effectively. Upon completion, students will be equipped with concrete strategies and confidence to build and lead effective teams.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5431",
        "date": "Fall 2025",
        "topic": "INFO 5431 Description"
    },
    {
        "text": "INFO 5431 is 4430 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5431",
        "date": "Fall 2025",
        "topic": "INFO 5431 Credits"
    },
    {
        "text": "INFO 5431 grading: Basis 3 Credits Stdnt Opt (Letter or S/U grades).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5431",
        "date": "Fall 2025",
        "topic": "INFO 5431 Grading"
    },
    {
        "text": "INFO 5505 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5505",
        "date": "Fall 2025",
        "topic": "INFO 5505 Title"
    },
    {
        "text": "INFO 5505 covers: To date, most computing technologies have primarily benefited urban, affluent, and literate people in developed regions by empowering them with more information, resources, and agency. These technologies currently exclude billions of people worldwide, such as rural residents, people with disabilities, and indigenous communities, who are too poor to afford modern devices, too remote to be connected, or too low-literate to navigate the mostly text-driven Internet. In recent years, researchers and practitioners have examined how computing technologies can be designed or appropriated to empower such underserved communities. This course introduces students to the field of Information and Communication Technologies and Development (ICTD). Through discussions of case studies from the Global South, students will study how computing technologies are used in different global development domains, such as agriculture, finance, health, social justice, and education. They will gain understanding of socio-economic, cultural, and political forces that impact technology adoption in low-resource environments and will learn to design, build, and evaluate inclusive technologies to empower marginalized people.?",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5505",
        "date": "Fall 2025",
        "topic": "INFO 5505 Description"
    },
    {
        "text": "INFO 5505 is 4505 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5505",
        "date": "Fall 2025",
        "topic": "INFO 5505 Credits"
    },
    {
        "text": "INFO 5505 grading: Basis 3 Credits Opt NoAud (Letter or S/U grades (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5505",
        "date": "Fall 2025",
        "topic": "INFO 5505 Grading"
    },
    {
        "text": "INFO 5556 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5556",
        "date": "Fall 2025",
        "topic": "INFO 5556 Title"
    },
    {
        "text": "INFO 5556 covers: This course covers the fundamental technical and organizational concepts and challenges related to the development of Business Intelligence Systems, a key component crucial to the competitiveness of a wide range of organizations. Topics covered include: data profiling, dimensional data modeling, data transformation, metadata systems, data governance, data delivery options, and an overview of emerging technologies in this space. Course is comprised of interactive lectures, work/lab sessions, and a substantial team project.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5556",
        "date": "Fall 2025",
        "topic": "INFO 5556 Description"
    },
    {
        "text": "INFO 5556 is 4555 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5556",
        "date": "Fall 2025",
        "topic": "INFO 5556 Credits"
    },
    {
        "text": "INFO 5556 grading: Basis 4 Credits GradeNoAud (Letter grades only (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5556",
        "date": "Fall 2025",
        "topic": "INFO 5556 Grading"
    },
    {
        "text": "INFO 5940 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5940",
        "date": "Fall 2025",
        "topic": "INFO 5940 Title"
    },
    {
        "text": "INFO 5940 covers: Study of topics not currently covered in INFO offerings, as determined by faculty and student interest.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5940",
        "date": "Fall 2025",
        "topic": "INFO 5940 Description"
    },
    {
        "text": "INFO 5940 is 4940 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5940",
        "date": "Fall 2025",
        "topic": "INFO 5940 Credits"
    },
    {
        "text": "INFO 5940 grading: Basis 3 Credits GradeNoAud (Letter grades only (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/5940",
        "date": "Fall 2025",
        "topic": "INFO 5940 Grading"
    },
    {
        "text": "INFO 4125 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4125",
        "date": "Fall 2025",
        "topic": "INFO 4125 Title"
    },
    {
        "text": "INFO 4125 covers: This introductory course will emphasize the interpersonal skills necessary by project teams to manage demanding industry projects. Through a semester long simulated IS project, students will develop and apply a range of skills including time management, effective conflict resolution, negotiation, risk management, change control, and appropriate goal setting to adequately manage and execute their projects. Students will work in teams to engage in the 5 phases of the project management life cycle which includes: project initiation, planning, execution, monitoring, and project closure.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4125",
        "date": "Fall 2025",
        "topic": "INFO 4125 Description"
    },
    {
        "text": "INFO 4125 is 5125 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4125",
        "date": "Fall 2025",
        "topic": "INFO 4125 Credits"
    },
    {
        "text": "INFO 4125 grading: Basis 3 Credits GradeNoAud (Letter grades only (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4125",
        "date": "Fall 2025",
        "topic": "INFO 4125 Grading"
    },
    {
        "text": "INFO 4140 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4140",
        "date": "Fall 2025",
        "topic": "INFO 4140 Title"
    },
    {
        "text": "INFO 4140 covers: This course explores selected topics in the law, policy, and politics of cybersecurity. Of specific interest will be a historical understanding of the development of the internet and how that history laid the foundation for the insecurity of products, services, and internet users’ experience. Using a four-factor approach: law, market, social norms, and technology, we will explore the global landscape and its implications for situating cybersecurity in international law and global internet governance. The focus of the course will be on the United States, however, and will include topics such as the federal government’s approach to cybersecurity, the National Cybersecurity Strategy, information security and risk management, types of cyberattacks and case studies, national defense generally and global internet governance.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4140",
        "date": "Fall 2025",
        "topic": "INFO 4140 Description"
    },
    {
        "text": "INFO 4140 is 5140 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4140",
        "date": "Fall 2025",
        "topic": "INFO 4140 Credits"
    },
    {
        "text": "INFO 4140 grading: Basis 3 Credits Stdnt Opt (Letter or S/U grades).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4140",
        "date": "Fall 2025",
        "topic": "INFO 4140 Grading"
    },
    {
        "text": "INFO 1170 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/1170",
        "date": "Fall 2025",
        "topic": "INFO 1170 Title"
    },
    {
        "text": "INFO 1170 covers: Artificial intelligence (AI) is impacting how organizations operate, make decisions, and deliver value across various sectors, including education, law, creative industries, insurance, and information technology. This course introduces the concepts, frameworks, and real-world applications needed to critically analyze how AI is adopted in organizations and the effects it has on work, learning, well-being, and society. Students will explore both the opportunities and risks of AI, including issues of bias, privacy, and organizational responsibility. Weekly hands-on activities and discussions will give students experience auditing or prototyping AI tools using no-code or low-code platforms, and case studies will bring sector-specific challenges to life. A culminating project allows students to investigate AI in a domain of their choice and present their insights in a university-wide showcase.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/1170",
        "date": "Fall 2025",
        "topic": "INFO 1170 Description"
    },
    {
        "text": "INFO 1170 is 5170 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/1170",
        "date": "Fall 2025",
        "topic": "INFO 1170 Credits"
    },
    {
        "text": "INFO 1170 grading: Basis 3 Credits Opt NoAud (Letter or S/U grades (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/1170",
        "date": "Fall 2025",
        "topic": "INFO 1170 Grading"
    },
    {
        "text": "INFO 4240 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4240",
        "date": "Fall 2025",
        "topic": "INFO 4240 Title"
    },
    {
        "text": "INFO 4240 covers: The social impact of technologies is typically thought about fairly late, if ever, in the design process. Indeed, it can be difficult at design time to predict what effects technologies will have. Nevertheless, design decisions can inadvertently lock in particular values early on. In this course, we will draw on science & technology studies, technology design, and the arts to analyze the values embodied in technology design and to design technologies to promote positive social impact. What social and cultural values do technology designs consciously or unconsciously promote? To what degree can social impact be built into a technology? How can we take social and cultural values into account in design?",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4240",
        "date": "Fall 2025",
        "topic": "INFO 4240 Description"
    },
    {
        "text": "INFO 4240 is 4240 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4240",
        "date": "Fall 2025",
        "topic": "INFO 4240 Credits"
    },
    {
        "text": "INFO 4240 grading: Basis 4 Credits Stdnt Opt (Letter or S/U grades).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4240",
        "date": "Fall 2025",
        "topic": "INFO 4240 Grading"
    },
    {
        "text": "INFO 4320 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4320",
        "date": "Fall 2025",
        "topic": "INFO 4320 Title"
    },
    {
        "text": "INFO 4320 covers: This class provides an introduction to modern rapid prototyping techniques such as laser cutting, 3D printing and microcontroller programming (such as the Arduino system). Using these tools, small multidisciplinary groups conduct the hardware project of their choice exploring topics as varied as: Universal Access, tangible interfaces, toys, personal or medical assistants and new musical instruments.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4320",
        "date": "Fall 2025",
        "topic": "INFO 4320 Description"
    },
    {
        "text": "INFO 4320 is 5321 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4320",
        "date": "Fall 2025",
        "topic": "INFO 4320 Credits"
    },
    {
        "text": "INFO 4320 grading: Basis 4 Credits Opt NoAud (Letter or S/U grades (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4320",
        "date": "Fall 2025",
        "topic": "INFO 4320 Grading"
    },
    {
        "text": "INFO 4320 prerequisites: INFO 2300 or INFO 2310..",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4320",
        "date": "Fall 2025",
        "topic": "INFO 4320 Prerequisites"
    },
    {
        "text": "INFO 3450 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/3450",
        "date": "Fall 2025",
        "topic": "INFO 3450 Title"
    },
    {
        "text": "INFO 3450 covers: This course focuses on user experience design (UX) and the life cycle of interface design from the user perspective. We will discuss key aspects of the human-centered design process: understanding, analyzing, and formalizing user needs, exploring possible design solutions to address user needs, creating prototypes to externalize design ideas, and evaluating the usability of these prototypes.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/3450",
        "date": "Fall 2025",
        "topic": "INFO 3450 Description"
    },
    {
        "text": "INFO 3450 is 5355 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/3450",
        "date": "Fall 2025",
        "topic": "INFO 3450 Credits"
    },
    {
        "text": "INFO 3450 grading: Basis 3 Credits GradeNoAud (Letter grades only (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/3450",
        "date": "Fall 2025",
        "topic": "INFO 3450 Grading"
    },
    {
        "text": "INFO 4430 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4430",
        "date": "Fall 2025",
        "topic": "INFO 4430 Title"
    },
    {
        "text": "INFO 4430 covers: This course provides practical, experiential training designed to enhance students' teamwork and team-leadership skills through hands-on activities, reflection, and collaborative discussions. Recognizing that technology fundamentally shapes how we collaborate, students will explore how to effectively use technological tools—such as remote collaboration platforms, virtual meeting applications, and novel AI tools—to enhance team interactions and productivity. Each session includes interactive tasks aimed at building critical interpersonal skills, including managing group dynamics, resolving conflicts, improving communication, facilitating decision-making processes, and developing leadership strategies in technologically supported environments. Students will regularly reflect on their personal experiences and collaboratively assess how different technologies influence teamwork and collaboration. Grounded in insights from organizational behavior, social psychology, and human-computer interaction, the course emphasizes the practical application of skills essential for navigating and leading teams effectively. Upon completion, students will be equipped with concrete strategies and confidence to build and lead effective teams.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4430",
        "date": "Fall 2025",
        "topic": "INFO 4430 Description"
    },
    {
        "text": "INFO 4430 is 5431 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4430",
        "date": "Fall 2025",
        "topic": "INFO 4430 Credits"
    },
    {
        "text": "INFO 4430 grading: Basis 3 Credits Stdnt Opt (Letter or S/U grades).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4430",
        "date": "Fall 2025",
        "topic": "INFO 4430 Grading"
    },
    {
        "text": "INFO 4505 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4505",
        "date": "Fall 2025",
        "topic": "INFO 4505 Title"
    },
    {
        "text": "INFO 4505 covers: To date, most computing technologies have primarily benefited urban, affluent, and literate people in developed regions by empowering them with more information, resources, and agency. These technologies currently exclude billions of people worldwide, such as rural residents, people with disabilities, and indigenous communities, who are too poor to afford modern devices, too remote to be connected, or too low-literate to navigate the mostly text-driven Internet. In recent years, researchers and practitioners have examined how computing technologies can be designed or appropriated to empower such underserved communities. This course introduces students to the field of Information and Communication Technologies and Development (ICTD). Through discussions of case studies from the Global South, students will study how computing technologies are used in different global development domains, such as agriculture, finance, health, social justice, and education. They will gain understanding of socio-economic, cultural, and political forces that impact technology adoption in low-resource environments and will learn to design, build, and evaluate inclusive technologies to empower marginalized people.?",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4505",
        "date": "Fall 2025",
        "topic": "INFO 4505 Description"
    },
    {
        "text": "INFO 4505 is 5505 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4505",
        "date": "Fall 2025",
        "topic": "INFO 4505 Credits"
    },
    {
        "text": "INFO 4505 grading: Basis 3 Credits Opt NoAud (Letter or S/U grades (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4505",
        "date": "Fall 2025",
        "topic": "INFO 4505 Grading"
    },
    {
        "text": "INFO 4555 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4555",
        "date": "Fall 2025",
        "topic": "INFO 4555 Title"
    },
    {
        "text": "INFO 4555 covers: This course covers the fundamental technical and organizational concepts and challenges related to the development of Business Intelligence Systems, a key component crucial to the competitiveness of a wide range of organizations. Topics covered include: data profiling, dimensional data modeling, data transformation, metadata systems, data governance, data delivery options, and an overview of emerging technologies in this space. Course is comprised of interactive lectures, work/lab sessions, and a substantial team project.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4555",
        "date": "Fall 2025",
        "topic": "INFO 4555 Description"
    },
    {
        "text": "INFO 4555 is 5556 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4555",
        "date": "Fall 2025",
        "topic": "INFO 4555 Credits"
    },
    {
        "text": "INFO 4555 grading: Basis 4 Credits GradeNoAud (Letter grades only (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4555",
        "date": "Fall 2025",
        "topic": "INFO 4555 Grading"
    },
    {
        "text": "INFO 4940 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4940",
        "date": "Fall 2025",
        "topic": "INFO 4940 Title"
    },
    {
        "text": "INFO 4940 covers: This course explores what artificial intelligence (AI) can teach us about human storytelling. We'll tackle this question through a two-pronged approach: story understanding and story generation. Students will explore how AI and machine learning technologies have revolutionized our approach to analyzing narratives as well as computational methods and concepts for modeling stories, moving towards a broader understanding of storytelling's societal effects.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4940",
        "date": "Fall 2025",
        "topic": "INFO 4940 Description"
    },
    {
        "text": "INFO 4940 is 5940 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4940",
        "date": "Fall 2025",
        "topic": "INFO 4940 Credits"
    },
    {
        "text": "INFO 4940 grading: Basis 3 Credits Stdnt Opt (Letter or S/U grades).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4940",
        "date": "Fall 2025",
        "topic": "INFO 4940 Grading"
    },
    {
        "text": "INFO 3350 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/3350",
        "date": "Fall 2025",
        "topic": "INFO 3350 Title"
    },
    {
        "text": "INFO 3350 covers: The class will introduce methods for computer-assisted analysis of historical and literary text collections. It will cover corpus curation, representing text as data, building statistical models from text, and interpreting quantitative results. The class will also reflect on how computational methods fit with existing practices in the humanities, and how we can use models as complements to our own interpretations. Following the course, students will be able to assist faculty in quantitative and computational humanities scholarship.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/3350",
        "date": "Fall 2025",
        "topic": "INFO 3350 Description"
    },
    {
        "text": "INFO 3350 is 6350 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/3350",
        "date": "Fall 2025",
        "topic": "INFO 3350 Credits"
    },
    {
        "text": "INFO 3350 grading: Basis 3 Credits Stdnt Opt (Letter or S/U grades).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/3350",
        "date": "Fall 2025",
        "topic": "INFO 3350 Grading"
    },
    {
        "text": "INFO 3350 prerequisites: INFO 2950..",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/3350",
        "date": "Fall 2025",
        "topic": "INFO 3350 Prerequisites"
    },
    {
        "text": "INFO 4410 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4410",
        "date": "Fall 2025",
        "topic": "INFO 4410 Title"
    },
    {
        "text": "INFO 4410 covers: \"Re-Designing Robots\" is a studio-based graduate course focused on building and deploying robots in real-world settings such as homes, workplaces, and public spaces. Students will work individually and collaboratively in interdisciplinary teams, incorporating perspectives from engineering, computer science, art, design, and social sciences. The course emphasizes critical examination of the societal roles and ethical implications of robotic technologies, encouraging students to ask not just how robots can function better, but how they can meaningfully and responsibly enhance human activities. Key topics include prototyping interactive robotic systems, video interaction analysis, and hands-on experimentation with physical robot prototypes. Through immersive, hands-on projects, students will develop the expertise to thoughtfully design robots that integrate seamlessly and responsibly into everyday life.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4410",
        "date": "Fall 2025",
        "topic": "INFO 4410 Description"
    },
    {
        "text": "INFO 4410 is 6420 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4410",
        "date": "Fall 2025",
        "topic": "INFO 4410 Credits"
    },
    {
        "text": "INFO 4410 grading: Basis 3 Credits GradeNoAud (Letter grades only (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4410",
        "date": "Fall 2025",
        "topic": "INFO 4410 Grading"
    },
    {
        "text": "INFO 4420 — Class Roster.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4420",
        "date": "Fall 2025",
        "topic": "INFO 4420 Title"
    },
    {
        "text": "INFO 4420 covers: This course will introduce User Experience design technique taught in a Studio. Students will work on a series of design studies and a semester long design project exploring advanced User Interaction design techniques. The course is designed to help students start a design portfolio to reflect their work. Students will be expected to buy small art supplies.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4420",
        "date": "Fall 2025",
        "topic": "INFO 4420 Description"
    },
    {
        "text": "INFO 4420 is 6520 credits.",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4420",
        "date": "Fall 2025",
        "topic": "INFO 4420 Credits"
    },
    {
        "text": "INFO 4420 grading: Basis 4 Credits GradeNoAud (Letter grades only (no audit)).",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4420",
        "date": "Fall 2025",
        "topic": "INFO 4420 Grading"
    },
    {
        "text": "INFO 4420 prerequisites: INFO 3450 or equivalent..",
        "label": "1",
        "source": "https://classes.cornell.edu/browse/roster/FA25/class/INFO/4420",
        "date": "Fall 2025",
        "topic": "INFO 4420 Prerequisites"
    }
]